from config import video_driver_uz

class Text_uzb:

    class greeting:
        main = "🚖TayyorTaxi телеграм ботига хуш келибсиз!\n\n" \
               "📍Бу ерда сиз Ўзбекистоннинг исталган нуқтасига таксига ва почта жўнатишга буюртма беришингиз мумкин"
        hello = "Xуш келибсиз!"
        passenger = "🚖 Такси"
        delivery = "📨 Почта"
        driver = "🚕 Йўлдаман"

    class video:
        client = "📲 Ботдан фойдаланиш бўйича кўрсатмалар"
        driver = "📲 Ҳайдовчи учун ботдан фойдаланиш бўйича кўрсатмалар"
        video_driver = video_driver_uz

    class menu:
        passenger = "🚖 Такси буюртмаси"
        delivery = "📨 Почта жўнатиш"
        order = "🗓 Фаол буюртмалар"
        information = "ℹ Маълумот"
        driver = "🙋 Мен ҳайдовчиман"
        settings = "⚙ Созламалар"
        main_menu = "🏠 Бош сахифа"
        online = "🚕 Йўлдаман"
        personal_cabinet = "🔑 Шахсий кабинет"
        change = "🔄 Йўловчи бўлиш"

    class symbol:
        sum = 'сўм'

    class information:
        about_us = "ℹ Ҳизмат хақида"
        how_to_use = "Қандай фойдаланилади"
        how_to_use2 = "❓ Қандай фойдаланилади"
        feedback = "☎ Алоқа"
        rules = "Хизмат кўрсатиш қоидалари"

    class feedback:
        feedback = "Қуйидаги контактлар орқали биз билан боғланишингиз мумкин👇\n\n" \
                   "Телеграм: @tayyortaxi_aloqabot"

    class url:
        class client:
            about_us = "https://telegra.ph/%D2%B2izmat-ha%D2%9Bida-06-29"
            how_to_use = "https://telegra.ph/%D2%9Aandaj-fojdalaniladi-06-29"
        class driver:
            how_to_use = "https://telegra.ph/%D2%9Aandaj-fojdalaniladi-06-29-2"
            about_us = "https://telegra.ph/%D2%B2izmat-ha%D2%9Bida-06-29-2"
            rules = "https://telegra.ph/Hizmat-k%D1%9Ersatish-shartlari-06-30"


    class buttons:
        class common:
            in_region = "Вилоят ичида"
            out_region = "Вилоятлараро"
            back = "⬅Ортга"
            cont = "➡Давом этиш"
            order = "✅Буюртма бериш"
            phone = "📱Менинг рақамим"
            trip = "Маршрут шартлари 👇"
            agree = "✅Тасдиқлаш"
            yes = "✅Тўғри"
            da = "✅Ҳа"
            no = "❌Йўқ"
            conditioner = "Кондиционер 👇"
        class passenger:
            date = "Кетиш санаси 👇"
            time = "Тахминий кетиш вақти 👇"
            num = "Йўловчилар сони 👇"
            choose_more = "➡Яна танлаш"
            baggage = "Юк ўлчамлари 👇"
        class delivery:
            package = "Юк ўлчамлари 👇"
            date = "Жўнатиш санаси  👇"
            time = "Жўнатиш вақти  👇"
            find_more = "➡ Яна қидириш"
        class driver:
            newRoute = "➕Янги маршрут қўшиш"
            route_cancel = "❌Бекор қилиш"
            price_change = "💵Нархни ўзгартириш"
            date = "Кетиш санаси 👇"
            free_places = "Бўш жойлар 👇"
            accept = "✅Қабул қилиш"
            reject = "❌Рад этиш"
            no_order = "Буюртма йўқ"
            passenger = "🚖 Такси 👇"
            delivery = "📨 Почта 👇"
            parking = "🅿️Пятак"
            home = "🏠Уй"
            trip_ways = {0 : parking, 1: home, 2 : home, 3: home}
            pas = "Йул."
        class cancel:
            client = "❌Буюртмани бекор қилиш"
            driver = "❌Бекор қилиш"
            driver_ok = "❌Барибир бекор қилиш"
        class personal_cabinet:
            class data:
                data = "✍Менинг ма’лумотларим"
                name = "Исмни ўзгартириш"
                phone = "Рақамни ўзгартириш"
                car = "Машинани ўзгартириш"
            class wallet:
                wallet = "💳Баланс"
                balance = "Балансни тўлдириш"
                payme = "Payme"
                click = "Click"
                paynet = "Paynet"
                pay = "✅Тўлаш"

    class questions:
        share_number = f"Телефон рақамингизни юборинг👇\n"\
                       f"<b>«📱Менинг рақамим»</b> тугмасини босишингиз мумкин ёки " \
                       f"қўлда киритишингиз мумкин: +998 ** *** ** **"
        class passenger:
            from_region = "Қаердан кетасиз? Худудни танланг 👇"
            from_town = "Қаердан кетасиз? Шахарни (туманни) танланг 👇"
            to_region = "Қаёққа кетяпсиз? Худудни танланг 👇"
            to_town = "Қаёққа кетяпсиз? Шахарни (туманни) танланг 👇"
            number_baggage = "Йўловчилар сони ва юк ўлчамларини белгиланг 👇"
            date = "🗓Кетиш санаси 👇"
            time = "⏰Тахминий йўлга чиқиш вақти 👇\n<i>Сиз бир нечтасини белгилашингиз мумкин</i>"
            trip = "Маршрут шартингизни танланг 👇"
            auto = "Автомобил моделини танланг 👇"
            car = "Қуйидагилардан танланг👇"
            phone = f"Телефон рақамингизни юборинг👇\n"\
                       f"<b>«📱Менинг рақамим»</b> тугмасини босишингиз мумкин ёки " \
                       f"қўлда киритишингиз мумкин: +998 ** *** ** **"

        class delivery:
            from_region = "Сиз почтани қаердан юборасиз? Ҳудудни танланг 👇"
            from_town = "Шахарни (туманни) танланг 👇"
            to_region =  "Почтани қаёққа юборасиз? Ҳудудни танланг👇"
            to_town = "Шахарни (туманни) танланг 👇"
            package = "Юк ўлчамларини танланг 👇"
            date = "🗓Жўнатиш санаси 👇"
            time = "⏰Тахминий йўлга чиқиш вақти 👇\n<i>Сиз бир нечтасини белгилашингиз мумкин</i>"
            trip = "Маршрут шартингизни танланг 👇"

        class driver:
            from_region = "Қаердан кетасиз? Ҳудудни танланг 👇"
            from_town = "Қаердан йўловчиларни олиб кетишингиз мумкин? 👇\n<i>3️⃣ тагача танлашингиз мумкин</i>"
            to_region = "Қаёққа кетяпсиз? Ҳудудни танланг 👇"
            to_town = "Қаёққа йўловчиларни оборишингиз мумкин? 👇\n<i>3️⃣ тагача танлашингиз мумкин</i>"
            towns = "Йўлингиз маршрутини белгиланг, 2️⃣та шаҳар (туман) танланг 👇"
            route_cancel = "Янги маршрут яратиш учун мавжудни бекор қилинг👇"
            sure = "Ҳақиқатан ҳам фаолиятингизни бекор қилмоқчимисиз? " \
                   "Бу маршрутда энди янги буюртмаларни олмайсиз."
            route = "Қайси маршрут билан кетяпсиз? 👇"
            out_region = "<b>Қайси йўналишларда юрасиз?</b>\n\n2 та ҳудудни танланг 👇"
            in_region = "<b>Қайси ҳудудда қатнайсиз?</b>\n\nҲудудни танланг 👇"
            cond = "Автомобилда кондиционер борми? 👇"
            price = "Питакдан питакгача 1️⃣ нафар йўловчи нархини белгиланг 👇\n\n" \
                    "<i>❗Ёдда тутингки, нарх қанча паст бўлса, йўловчини рўйхатда шунча юқори бўласиз</i>"
            change = "Ҳақиқатан ҳам йўловчи бўлмоқчимисиз?\n\nСизнинг маълумотларингиз сақланади"
        class registration:
            name = "Исмингизни киритинг, уни йўловчилар кўради"
            phone = "Сиз билан боғланиш учун телефон рақамингизни юборинг 👇"
            auto = "Автомобилингиз моделини танланг 👇"
            agreement = "Ҳаммаси тўғрими? 👇\n\n<b>«✅Тўғри»</b>, тугмасини босиш орқали сиз хизмат кўрсатиш шартлари " \
                        "билан танишганингизни ва розилигингизни тасдиқлайсиз - 👉'"


    class chain:
        class passenger:
            from_place = "Қаердан"
            to_place = "Қаёққа"
            date = "Кетиш санаси"
            time = "Кетиш вақти"
            num = "Йўловчилар сони"
            baggage = "Юк"
            phone = "Телефон"

            car_find1 = "Сиз учун "
            car_find2 = "та машина мавжуд"
            car_not_found = "Афсуски, бу йўналишдаги автомобиллар ҳозирда топилмади, кейинроқ қайта уриниб кўринг."
            car = "Модел"

            driver = "Ҳайдовчи"
            places = "Бўш жойлар"
            conditioner = "Кондиционер"
            price = "1 йўловчи учун нарх"
            info = "Сизнинг маълумотларингиз"

            cost1 = "Умумий"
            cost2 = "йўловчига"
            trip = "<i>*нарх питакдан питакгача кўрсатилган</i>"

        class delivery:
            info = "Сизнинг маълумотларингиз"
            driver = "Ҳайдовчи"
            phone = "Телефон"
            from_place = "Қаердан"
            to_place = "Қаёққа"
            date = "Жўнатиш санаси"
            time = "Жўнатиш вақти"
            baggage = "Юк"
            car = "Модел"
            price = "Етказиб бериш нархи"

            cost = "Етказиб бериш нархи"
            trip = "<i>*нарх питакдан питакгача кўрсатилган</i>"

        class driver:
            allRoute = "Сизнинг фаол маршрутларингиз 👇"
            route = "Маршрут"
            from_place = "Қаердан"
            to_place = "Қаёққа"
            date = "Кетиш санаси"
            places = "Бўш жойлар"
            price = "1 йўловчи учун нарх"
            price2 = "1️⃣ йўловчи"
            pyatak = "пятак"
            conditioner = "Кондиционер"
            trip = "Маршрут шартлари"
            alright = "Ҳаммаси тўғрими?"
            onepass = '1 йўл.'
            name = "Исмингиз"
            phone = "Телефон"
            car = "Машина"
            cost = 'Умумий даромад'
        class personal_cabinet:
            change_name = "Исмни ўзгартириш"
            change_phone = "Рақамни ўзгартириш"
            change_car = "Машинани ўзгартириш"
            change_param = {'name': change_name, 'phone': change_phone, "car": change_car}
            new_data = "Янги ма’лумотни киритинг 👇"
            new_data_rec = "Ма’лумот ўзгартирилди."
            payment = "Тўлдириш миқдорини белгиланг 👇"
            pay_way = "Тўлов турини танланг 👇"
            amount = "Тўлов миқдори"

            pay_way2 = "Тўлов орқали"
            amount2 = "Тўлов миқдори"
            payment2 = '<i>Тўлов ўтқазиш учун <b>«✅Тўлаш»</b>  тугмасини босинг </i> 👇'
            accept = '✅Тўлов ўтқазилди\n\nБалансингизга киритилган миқдор'

    class order:
        active_orders = '<i>Буюртмангиз ҳолатини <b>«🗓 Фаол Буюртмалар»</b> саҳифасида кузатишингиз мумкин</i>'
        class client:
            passenger = f"Ариза ҳайдовчига жўнатилди, тасдиқлангандан сўнг сизга билдиришнома келади.\n\n" \
                        f"<b>Сиз бир нечта ҳайдовчиларга ариза юборишингиз мумкин, " \
                        f"аризани биринчи бўлиб қабул қилган киши билан йўлга чиқасиз.</b>\n\n" \
                        f"Яна танлайсизми?"

            delivery = f"Буюртма ҳайдовчиларга жўнатилди, қабул қилингандан сўнг сизга хабарнома келади."
            accept = "✅ Ариза ҳайдовчи томонидан қабул қилинди\n📲Ҳайдовчи сиз билан телефон орқали боғланади"
            reject = '❌ Ариза ҳайдовчи томонидан рад этилди\n\n' \
                     'Бошқа ҳайдовчини танлашингиз мумкин 👇'
        class driver:
            driver = f'✅ Сизнинг аризангиз қабул қилинди. Йўловчилар жавоб беришлари билан сиз хабарнома оласиз.\n\n' \
                     f'<i>Буюртмалар ҳолатини <b>«🗓 Фаол Буюртмалар»</b> саҳифасида кузатишингиз мумкин</i> 👇'
            route_cancel = "❌ Фаолият бекор қилинди, мижозлар сизни бошқа ҳайдовчилар рўйхатида кўрмайди.\n\n" \
                           "❕Йўловчилар учун яна фаол бўлиш учун <b>«🚕 Йўлдаман»</b> тугмасини босинг."
            order = 'Буюртма ва мижоз маълумотларини олиш учун <b>«✅Қабул қилиш»</b> тугмасини босинг.'
            order_cost1 = 'Хизмат нархи '
            order_cost2 = '<b>сўмни</b> ташкил этади, маблағ балансингиздан ечиб олинади.'
            accept = "✅ Ариза қабул қилинди, йўловчига буюртма қабул қилинганлиги ҳақида хабар бердик"
            reject = '❌ Ариза рад этилди'
            info = "Йўловчини маʼлумотлари"
            phone_client = "Телефон"
            new_order = "Янги буюртма"
            passenger = "🚖 Такси"
            delivery = "📨 Почта"
            type_order = {"passenger": passenger, "delivery": delivery}

    class active_order:
        no_active_order = "Сизда ҳозирда ҳеч қандай фаол буюртма йўқ"
        class client:
            car_full = "✅ Автомобил салони муваффақиятли тўлдирилди"
            driver_call = "📲 Ҳайдовчи сиз билан телефон орқали боғланади"
        class driver:
            places = '❗ Йўловчилар машинадаги бўш жойларни кўришади\n\n' \
                     '<i>Мавжуд бўш жойни «➖» ва «➕» орқали ўзгартиришингиз мумкин</i> 👇'
            date = 'Санани танланг 👇'
            place = 'Йўналишни танланг 👇'
            cancel_order = "Бекор қилинди"
            cancel_trip = "Бекор қилинди"
            client_info = 'Йўловчини маʼлумотлари'

    class cancel:
        class client:
            cancel_question_order = "Буюртмани бекор қилмоқчимисиз? Бу ҳаракатни қайтариб бўлмайди."
            cancel_order = "❌ Буюртма бекор қилинди."
            delivery = "❌ Афсуски, бўш машина топилмади\n\nИлтимос кейинроқ қайта уриниб кўринг"
            class driver:
                delete = "❌ Афсуски, ҳайдовчи аризани бекор қилди"
                cancel = "❌ Ариза ҳайдовчи томонидан рад этилди"
                new_driver = "Бошқа ҳайдовчи танлашингиз мумкин 👇"

        class driver:
            passenger = '❌Йўловчи аризани бекор қилди, маблағ ҳамёнингизга қайтарилади'
            delivery = '❌Мижоз аризани бекор қилди, маблағ ҳамёнингизга қайтди'
            driver = "Ишончингиз комилми? Агар буюртма ҳайдовчи томонидан бекор қилинса маблағ " \
                     "балансингизга қайтарилмайди"

    class personal_cabinet:
        name = "Исмингиз"
        phone = "Телефон"
        car = "Машина"
        id = "ID"
        wallet = "Баланс"
        common = "Асосий"
        bonus = "Бонус"
        congratulation = "Табриклаймиз! Хизматда рўйхатдан ўтганингиз учун сизга 💵 <b>100 000</b> сўм бонус берилди\n\n" \
                         "<b>❕Бонусдан фойдаланиш муддати - 20 кун</b>\n\n" \
                         "Аввал ма’лумотни кўриб чиқинг 👇"
        online = "Йўловчи буюртмаларини қабул қилишни бошлаш учун «🚕 Йўлдаман» тугмасини босинг👇"

    class alert:
        class phone:
            alert = "Қайта уриниб кўринг 😅"

        class passenger:
            zeroTown = "Афсуски сиз белгилаган маршрутда ҳозирги пайтда ҳайдовчилар топилмади"

        class driver:
            zeroTowns = "Шаҳарларни белгиланг "
            fourthTown = "3️⃣ шаҳарни танлашингиз мумкин"
            check = "Сиз аввал ушбу сана ва йўналиш учун буюртма яратгансиз"
            town = "❗ 10 та гача танлаш мумкин"
            accept_order_late = "❌ Мурожаат бошқа ҳайдовчи томонидан қабул қилинганлиги ёки аризага сизнинг " \
                                "тарафингиздан узоқ жавоб берилганлиги сабабли автоматик рад этилган"
            places_now = "Энди машинада"
            places_free = "бўш жой"
            places_error =  "4 та жойдан ортиқ мавжуд жой йўқ"
            places_error2 = "Қолган жойлар мавжуд бўлган йўловчилар билан банд, жой бўшатиш учун айнан " \
                            "йўловчинига босиб уни ўчириб ташланг👇"
            places_error3 = "❗ Салонизда йетарли жой мавжуд эмас"
            places_full = "Машина тўлган, биз йўловчиларга хабарнома юбордик"
            insufficient_funds = "Балансингизда маблағингиз етарли эмас, балансингизни тўлдиринг." \
                                 "🔑 Шахсий кабинет —> 💳 Баланс —> Балансни тўлдириш"
            insufficient_funds2 = "🔔 Эслатма!\n\n" \
                                  "Кейинги буюртмани қабул қилиш учун балансингизда етарли маблағ йўқ, " \
                                  "фаол бўлиш учун балансингизни тўлдиринг"
            prolongation = "❗ Сизнинг фаолиятингиз бугун соат 00:00 да тугайди мижозлар сизни ҳайдовчилар " \
                           "рўйхатида бошқа кўролмайди\n\n" \
                           "Қайта фаол бўлиш учун <b>«🚕 Йўлдаман»</b> тугмасини босинг👇"
    # main text

    class option:
        yes = "Бор"
        no = "Йўқ"
        da = "Ха"
        option = {0: no, 1:yes}

    class baggage:
        gab1 = "🧰25х15 см"
        gab2 = "🧰30х20 см"
        gab3 = "🧰55х35 см"
        gab4 = "🧰40х25 см"
        gab5 = "✉ Ҳужжат"
        delivery = [gab1, gab2, gab3, gab4, gab5]
        package_gab = {0: gab1, 1: gab2, 2: gab3, 3: gab4, 4: gab5}

    class mailing:
        class left_days:
            text1 = "🔔 Эслатма! Сизда"
            text2 = " бонус бор.\n❗ Бонус маблағлари тугашига "
            text3 = "<b>кун</b> қолди!\n<b>Тугаш санаси</b>"
            text4 = ", 23:59 да"

    class quiz:
        main = "Айни пайтда Пайнет орқали тўлов уланмаган.\n\n" \
               "<b>Пайнет орқали ҳамёнингизни тўлдириш сизга қулайроқ бўладими?</b>👇"
        thanks = "Маълумот учун раҳмат, тез орада ушбу тўлов усулини қўшамиз."
        yes = "✅ Ҳа, қулайроқ"


    thanks = "Здесь могла быть ваша реклама"


    text_none = "текст"